app/controllers/onepage_controller.rb

  def index

      @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]